app/controllers/ajouter_controller.rb

  def ajouter
  	 gossip = Gossip.new
  	 gossip.author = params['author_gossip']
  	 gossip.content = params['gossip']
  	 gossip.save
---
INSERT INTO "gossips" ("author", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["author", "lol"], ["content", "lololol"], ["created_at", "2018-10-30 07:28:44.390213"], ["updated_at", "2018-10-30 07:28:44.390213"]]