app/controllers/modification_controller.rb

  def modification
  	@gossip = Gossip.find(params['id'])
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]

  def modification_gossip
  	Gossip.find(params[:author_id]).update content:params[:gossip]
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "gossips" SET "content" = $1, "updated_at" = $2 WHERE "gossips"."id" = $3  [["content", "lol"], ["updated_at", "2018-10-30 08:26:05.933072"], ["id", 1]]