app/controllers/suppression_controller.rb

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "gossips" WHERE "gossips"."id" = $1  [["id", 2]]
---
  def suppression
  	@gossip = Gossip.find(params['id'])
  	@gossip.destroy